---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.ContainsKey(Autodesk.Revit.DB.ExportPatternKey)
source: html/9a61fb42-6631-3d3c-029d-fe519b922379.htm
---
# Autodesk.Revit.DB.ExportPatternTable.ContainsKey Method

Checks whether a pattern key exists in the table.

## Syntax (C#)
```csharp
public bool ContainsKey(
	ExportPatternKey exportpatternKey
)
```

## Parameters
- **exportpatternKey** (`Autodesk.Revit.DB.ExportPatternKey`) - The export pattern Key.

## Returns
True if the pattern key exists in the table.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null